In [1]:
%matplotlib inline
from bs4 import BeautifulSoup
import requests
import pandas as pd
import matplotlib
import numpy as np
import matplotlib.pyplot as plt
matplotlib.style.use('ggplot')
import seaborn as sns
sns.set(style="whitegrid", color_codes=True)

In [2]:
df_items = pd.read_csv('items.csv')

In [3]:
df_item_categories = pd.read_csv('item_categories.csv')

In [4]:
df_shops = pd.read_csv('shops.csv')

In [5]:
df_train = pd.read_csv('sales_train_v2.csv')

In [6]:
df_items.shape

(22170, 3)

In [7]:
df_item_categories.shape

(84, 2)

In [8]:
df_shops.shape

(60, 2)

In [9]:
df_train.shape

(2935849, 6)

In [10]:
df_train.columns

Index([u'date', u'date_block_num', u'shop_id', u'item_id', u'item_price',
       u'item_cnt_day'],
      dtype='object')

In [11]:
df_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [12]:
df_shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [13]:
df_items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [14]:
df_item_categories.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [15]:
df_sales_history = df_train.copy()

In [16]:
df_sales_history = pd.merge(df_sales_history, df_items, on='item_id')[list(df_train.columns) + ['item_category_id']]

In [17]:
df_sales_history.shape

(2935849, 7)

In [18]:
df_train.shape

(2935849, 6)

In [19]:
df_sales_history.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_category_id
0,02.01.2013,0,59,22154,999.0,1.0,37
1,23.01.2013,0,24,22154,999.0,1.0,37
2,20.01.2013,0,27,22154,999.0,1.0,37
3,02.01.2013,0,25,22154,999.0,1.0,37
4,03.01.2013,0,25,22154,999.0,1.0,37

In [20]:
from datetime import datetime

In [21]:
df_sales_history['date'] = [datetime.date(datetime.strptime(i,'%d.%m.%Y')) for i in df_sales_history.date.values]

In [22]:
df_sales_history.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_category_id
0,2013-01-02,0,59,22154,999.0,1.0,37
1,2013-01-23,0,24,22154,999.0,1.0,37
2,2013-01-20,0,27,22154,999.0,1.0,37
3,2013-01-02,0,25,22154,999.0,1.0,37
4,2013-01-03,0,25,22154,999.0,1.0,37

#### Range of Dates

In [23]:
print df_sales_history.date.max()
print df_sales_history.date.min()

2015-10-31
2013-01-01

Ranges from Jan 1 2013 to Oct 31 2015

In [24]:
#### Number of Shops

In [25]:
len(df_sales_history.shop_id.unique())

60

In [26]:
#### Number of items
len(df_sales_history.item_id.unique())

21807

In [27]:
pd.set_option('display.float_format', lambda x: '%.6f' % x)

In [28]:
#### Item Price Range
df_sales_history.item_price.describe()

count   2935849.000000
mean        890.853233
std        1729.799631
min          -1.000000
25%         249.000000
50%         399.000000
75%         999.000000
max      307980.000000
Name: item_price, dtype: float64

In [29]:
df_sales_history[df_sales_history.item_price <= 0]

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_category_id
56049,2013-05-15,4,32,2973,-1.000000,1.000000,19

In [30]:
#### Item Counts
df_sales_history.item_cnt_day.value_counts()

1.000000      2629372
2.000000       194201
3.000000        47350
4.000000        19685
5.000000        10474
-1.000000        7252
6.000000         6338
7.000000         4057
8.000000         2903
9.000000         2177
10.000000        1820
11.000000        1263
12.000000        1083
13.000000         918
14.000000         716
15.000000         638
16.000000         544
17.000000         438
18.000000         391
20.000000         364
19.000000         347
21.000000         290
22.000000         242
24.000000         204
23.000000         198
25.000000         180
26.000000         176
30.000000         147
28.000000         131
27.000000         130
               ...
95.000000           1
96.000000           1
102.000000          1
105.000000          1
109.000000          1
112.000000          1
113.000000          1
118.000000          1
128.000000          1
129.000000          1
131.000000          1
132.000000          1
135.000000          1
146.000000          1
200.000000          1
147.000000          1
149.000000          1
153.000000          1
154.000000          1
156.000000          1
157.000000          1
504.000000          1
163.000000          1
164.000000          1
167.000000          1
179.000000          1
187.000000          1
194.000000          1
195.000000          1
508.000000          1
Name: item_cnt_day, Length: 198, dtype: int64

In [31]:
#### Item Category Counts

In [32]:
len(df_sales_history.item_category_id.unique())

84

In [33]:
#### Check to see if there are missing values and if column values are valid

In [34]:
np.any(df_sales_history.isnull())

False

In [35]:
df_sales_history.date_block_num.unique()

array([ 0,  1,  2,  3,  7,  8,  9, 11, 30, 31, 32, 33,  4,  6, 17, 28,  5,
       10, 12, 13, 14, 18, 19, 21, 15, 24, 16, 20, 22, 23, 25, 26, 27, 29])

In [36]:
df_sales_history.shop_id.unique()

array([59, 24, 27, 25,  6, 15,  7, 31, 54, 42, 38, 37, 46, 44, 51, 16,  1,
        0, 28, 57, 23, 58, 56, 35, 47, 21, 30,  4, 22, 50, 19, 18, 14, 17,
       41, 52,  8, 12, 26, 29, 53,  3, 43, 45, 32, 13,  5,  2, 10, 49, 39,
       48, 33, 11,  9, 34, 40, 36, 20, 55])

In [37]:
df_sales_history.item_id.unique()

array([22154,  2552,  2554, ...,  7610,  7635,  7640])

In [38]:
%matplotlib inline

In [39]:
df_sales_history.reset_index(inplace=True)

In [40]:
df_sales_history['month'] = [i.month for i in df_sales_history.date]
df_sales_history['day'] = [i.day for i in df_sales_history.date]
df_sales_history['yr'] = [i.year for i in df_sales_history.date]

In [41]:
df_sales_history['month_year'] = [str(val.month) + '_' + str(val.year) for val in df_sales_history.date]

In [42]:
df_test = pd.read_csv('test.csv')

In [43]:
df_sample = pd.read_csv('sample_submission.csv')

In [44]:
month_year_block_dict = dict(zip(list(df_sales_history.date_block_num.values), 
                                 list(df_sales_history.month_year.values)))

In [45]:
df_test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [46]:
group_df = df_sales_history.groupby(['shop_id','item_id','date_block_num'])['item_cnt_day'].sum()

In [47]:
group_df.loc[5,5037,:]

shop_id  item_id  date_block_num
5        5037     20               1.000000
                  22               1.000000
                  23               2.000000
                  24               2.000000
                  28               1.000000
                  29               1.000000
                  30               1.000000
                  31               3.000000
                  32               1.000000
Name: item_cnt_day, dtype: float64

In [48]:
vals = list()
for i, row in df_test.iterrows():
    shop_id = row.shop_id
    item_id = row.item_id
    try:
        group_vals = group_df.loc[shop_id,item_id,:]
        val = group_vals.loc[:,:,22:].sum()/12.0
    except:
        val = 0.
    vals.append(val)

In [49]:
df_test.shape

(214200, 3)

In [50]:
len(vals)

214200

In [51]:
df_test['ans'] = vals

In [53]:
df_test.head()

   ID  shop_id  item_id      ans
0   0        5     5037 1.000000
1   1        5     5320 0.000000
2   2        5     5233 0.833333
3   3        5     5232 0.083333
4   4        5     5268 0.000000

In [54]:
df_sample.head()

   ID  item_cnt_month
0   0        0.500000
1   1        0.500000
2   2        0.500000
3   3        0.500000
4   4        0.500000

In [55]:
df_sub1 = df_test[['ID','ans']]

In [56]:
df_sub1.columns = ['ID','item_cnt_month']

In [59]:
df_sub1.to_csv('./sub1.csv',index=0)

In [60]:
df_sales_history.shape

(2935849, 12)

In [63]:
df_sales_history.columns

Index([u'index', u'date', u'date_block_num', u'shop_id', u'item_id',
       u'item_price', u'item_cnt_day', u'item_category_id', u'month', u'day',
       u'yr', u'month_year'],
      dtype='object')

In [64]:
df_sales_history.drop('index',inplace=True,axis=1)
df_sales_history.to_csv('df_sales_history.csv',index=0)